In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('Mumbai1.csv')
df.head()

   Index    Price  Area  Location  Bedrooms
0      0  4850000   720  Kharghar         1
1      1  4500000   600  Kharghar         1
2      2  6700000   650  Kharghar         1
3      3  4500000   650  Kharghar         1
4      4  5000000   665  Kharghar         1

In [3]:
df=df.drop(['Index'],axis=1)

In [4]:
df.head()

     Price  Area  Location  Bedrooms
0  4850000   720  Kharghar         1
1  4500000   600  Kharghar         1
2  6700000   650  Kharghar         1
3  4500000   650  Kharghar         1
4  5000000   665  Kharghar         1

In [5]:
df.shape

(6347, 4)

In [6]:
df1=df['Location'].value_counts()
df1

Kharghar             533
Thane West           418
Mira Road East       390
Ulwe                 319
Borivali West        176
                    ...
worli sea face         1
Sea Face               1
Shiv Sagar Estate      1
Natakwala Lane         1
Padle Gaon             1
Name: Location, Length: 413, dtype: int64

In [7]:
len(df1)

413

In [8]:
df1=df1[df1>9]

In [9]:
len(df1)

92

In [10]:
def function(x):
    if x in df1:
        return x
    else:
        return None

In [11]:
df['Location']=df['Location'].apply(function)

In [12]:
df.shape

(6347, 4)

In [13]:
df[df['Location']=='Padle Gaon']

Empty DataFrame
Columns: [Price, Area, Location, Bedrooms]
Index: []

In [14]:
df.isnull().sum()

Price         0
Area          0
Location    778
Bedrooms      0
dtype: int64

In [15]:
df=df.dropna()

In [16]:
df.isnull().sum()

Price       0
Area        0
Location    0
Bedrooms    0
dtype: int64

In [17]:
df.shape

(5569, 4)

In [18]:
df2=pd.get_dummies(df.Location)
df=pd.concat([df,df2],axis=1)
df.head()

,Price,Area,Location,Bedrooms,Airoli,Ambernath East,Ambernath West,Andheri,Andheri East,Andheri West,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,4850000,720,Kharghar,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,4500000,600,Kharghar,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,6700000,650,Kharghar,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,4500000,650,Kharghar,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5000000,665,Kharghar,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [19]:
df.shape

(5569, 96)

In [20]:
df=df.drop(['Location'],axis=1)
df.head()

,Price,Area,Bedrooms,Airoli,Ambernath East,Ambernath West,Andheri,Andheri East,Andheri West,Badlapur East,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,4850000,720,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,4500000,600,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,6700000,650,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,4500000,650,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5000000,665,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [21]:
y=df.Price
X = df.drop(['Price'],axis=1)

In [22]:
X.head()

,Area,Bedrooms,Airoli,Ambernath East,Ambernath West,Andheri,Andheri East,Andheri West,Badlapur East,Bandra East,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,720,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,600,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,650,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,650,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,665,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [23]:
y.head()

0    4850000
1    4500000
2    6700000
3    4500000
4    5000000
Name: Price, dtype: int64

In [24]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=10)

In [25]:
from sklearn import tree
data = tree.DecisionTreeRegressor()
data = data.fit(X,y)
data.score(X_train,y_train)

0.9940825626456298

In [26]:
def price_prediction(Location,Area,Bedrooms):
    loc_index = np.where(X.columns==Location)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = Area
    x[1] = Bedrooms
    if loc_index >= 0:
        x[loc_index] = 1

    return data.predict([x])[0]

In [27]:
price_prediction('Kharghar',700,2)

7000000.0

In [28]:
price_prediction('Kharghar',500,1)

3700000.0

In [29]:
price_prediction('Airoli',700,2)

13500000.0

In [30]:
price_prediction('mumbai',700,2)

28000000.0

In [31]:
import pickle
with open('Mumbai_model.pickle','wb')as f:
    pickle.dump(data,f)

In [33]:
import json
columns = {
    'coloumsm' : [col.lower() for col in X.columns]
}
with open("mumbai_columns.json","w") as f:
    f.write(json.dumps(columns))